cask_args appdir: '~/Applications'

tap 'aspnet/dnx'
tap 'atlassian/tap'
tap 'boxen/brews'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'facebook/fb'
tap 'homebrew/binary'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/fuse'
tap 'homebrew/head-only'
tap 'homebrew/science'
tap 'homebrew/versions'

brew 'ack'
brew 'ansible'
brew 'ant'
brew 'aspell'
brew 'aspnet/dnx/dnvm'
brew 'aspnet/dnx/kvm'
brew 'atk'
brew 'atlassian/tap/atlassian-plugin-sdk'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'awscli', args: ['HEAD']
brew 'bash'
brew 'bazaar'
brew 'bfg'
brew 'bison'
brew 'boost'
brew 'boot2docker'
brew 'boxen/brews/dnsmasq'
brew 'boxen/brews/gcc48'
brew 'boxen/brews/gcc5'
brew 'boxen/brews/mongodb'
brew 'boxen/brews/mysql'
brew 'boxen/brews/nginx'
brew 'cairo'
brew 'carthage'
brew 'cmake'
brew 'cmatrix'
brew 'coreutils'
brew 'cowsay'
brew 'cunit'
brew 'curl', args: ['with-nghttp2']
brew 'czmq'
brew 'dialog'
brew 'enchant'
brew 'facebook/fb/buck'
brew 'fftw'
brew 'findutils'
brew 'fleetctl'
brew 'fontconfig'
brew 'fontforge'
brew 'fpp'
brew 'freetype'
brew 'fzf'
brew 'gawk'
brew 'gd'
brew 'gdb'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'git-lfs'
brew 'git'
brew 'glib-networking'
brew 'glib'
brew 'gmp'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnuplot'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'graphviz'
brew 'grc'
brew 'gsettings-desktop-schemas'
brew 'gtk+3'
brew 'harfbuzz'
brew 'hicolor-icon-theme'
brew 'homebrew/boneyard/gitstats', args: ['HEAD']
brew 'homebrew/boneyard/ngrok'
brew 'homebrew/fuse/tup'
brew 'homebrew/science/glpk'
brew 'homebrew/science/vips'
brew 'homebrew/versions/cloog018'
brew 'homebrew/versions/gmp4'
brew 'homebrew/versions/isl011'
brew 'homebrew/versions/isl014'
brew 'homebrew/versions/libmpc08'
brew 'homebrew/versions/mpfr2'
brew 'htop-osx'
brew 'hub'
brew 'icu4c'
brew 'imagemagick'
brew 'intltool'
brew 'jansson'
brew 'jenkins'
brew 'jpeg'
brew 'leptonica'
brew 'libepoxy'
brew 'libev'
brew 'libevent'
brew 'libexif'
brew 'libffi'
brew 'libgit2'
brew 'libgsf'
brew 'libmpc'
brew 'libpng'
brew 'libsass'
brew 'libsodium'
brew 'libsoup'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libxml2'
brew 'libyaml'
brew 'little-cms2'
brew 'lua'
brew 'mas'
brew 'makedepend'
brew 'maven'
brew 'md5sha1sum'
brew 'mercurial'
brew 'mono'
brew 'mpfr'
brew 'msgpack'
brew 'nettle'
brew 'nghttp2'
brew 'openssl'
brew 'optipng'
brew 'orc'
brew 'p7zip'
brew 'packer'
brew 'pango'
brew 'pcre'
brew 'pidof'
brew 'pixman'
brew 'pkg-config'
brew 'pngcrush'
brew 'protobuf', args: ['HEAD']
brew 'pstree'
brew 'py2cairo'
brew 'pygobject3'
brew 'python'
brew 'python3'
brew 'qt5'
brew 'readline'
brew 'redis'
brew 'rust'
brew 'sassc'
brew 'scala'
brew 'scons'
brew 'sl'
brew 'spark'
brew 'spdylay'
brew 'sphinx-doc'
brew 'sqlite'
brew 'terminal-notifier'
brew 'terraform'
brew 'tesseract'
brew 'thrift'
brew 'tmate'
brew 'tree'
brew 'ttfautohint'
brew 'unar'
brew 'vala'
brew 'watch'
brew 'webkitgtk'
brew 'webp'
brew 'wget'
brew 'xctool'
brew 'xz'
brew 'zeromq'
brew 'zookeeper'
brew 'zsh-syntax-highlighting'

cask '1password'
cask 'appcleaner'
cask 'caffeine'
cask 'chefdk'
cask 'cleanmymac'
cask 'cloud'
cask 'consul'
cask 'cyberduck'
cask 'disk-inventory-x'
cask 'diskwave'
cask 'dropbox'
cask 'fing'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'flux'
cask 'geektool'
cask 'github-desktop'
cask 'google-chrome'
cask 'google-drive'
cask 'gpgtools'
cask 'hammerspoon'
cask 'harvest'
cask 'hashcat'
cask 'hipchat'
cask 'hyperterm'
cask 'istat-menus'
cask 'iterm2-beta'
cask 'java'
cask 'kap'
cask 'karabiner-elements'
cask 'kindle'
cask 'magicprefs'
cask 'mancy'
cask 'mojibar'
cask 'mplayerx'
cask 'pgadmin3'
cask 'rdm'
cask 'royal-tsx'
cask 'sequel-pro'
cask 'shimo'
cask 'slack'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark'

mas 'Fantastical', id: 435003921
mas 'GarageBand', id: 682658836
mas 'Gifox', id: 1082624744
mas 'Image2Icon', id: 992115977
mas 'iMovie', id: 408981434
mas 'iPhoto', id: 408981381
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pushbullet', id: 948415170
mas 'QuickCast', id: 710575188
mas 'Simple Desktops', id: 460866217
mas 'SonicWALL Mobile Connect', id: 822514576
mas 'StuffIt Expander', id: 405580712
mas 'Twitter', id: 409789998
mas 'Wake Up Time', id: 495945638
mas 'Xcode', id: 497799835
