cask_args appdir: '/Applications'

tap "homebrew/dupes"
tap "homebrew/fuse"
tap "homebrew/science"
tap "homebrew/head-only"
tap "homebrew/core"
tap "homebrew/versions"
tap "homebrew/binary"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "go-delve/delve"
tap "caskroom/versions"
tap "caskroom/cask"

cask "java"

brew "ack"
brew "ant"
brew "archey"
brew "aspell"
brew "gettext"
brew "libffi"
brew "pcre"
brew "glib"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "pixman"
brew "cairo"
brew "git"
brew "gobject-introspection"
brew "atk"
brew "autoconf"
brew "awscli", args: ["HEAD"]
brew "bash"
brew "bazel"
brew "bfg"
brew "bison"
brew "blueutil"
brew "boost"
brew "carthage"
brew "ccat"
brew "cloc"
brew "gmp@4"
brew "cloog", link: false
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "ctop"
brew "cunit"
brew "curl", args: ["with-nghttp2"], link: true
brew "dialog"
brew "python"
brew "enchant"
brew "etcd"
brew "fftw"
brew "findutils"
brew "jpeg"
brew "libtiff"
brew "libtool"
brew "icu4c"
brew "harfbuzz"
brew "pango"
brew "fontforge"
brew "fortune"
brew "fpp"
brew "fswatch"
brew "fzf"
brew "gmp"
brew "mpfr"
brew "gawk"
brew "mpfr@2"
brew "isl@0.14"
brew "webp"
brew "gd"
brew "gdb"
brew "gdk-pixbuf"
brew "git-lfs"
brew "libtasn1"
brew "nettle"
brew "gnutls"
brew "gsettings-desktop-schemas"
brew "glib-networking"
brew "go"
brew "glide"
brew "glpk"
brew "gnu-sed"
brew "gnu-tar"
brew "lua"
brew "gnuplot"
brew "graphviz"
brew "grc"
brew "hicolor-icon-theme"
brew "libepoxy"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "intltool"
brew "isl@0.11"
brew "jansson"
brew "jq"
brew "libcaca"
brew "libev"
brew "libexif"
brew "libssh2"
brew "libgit2"
brew "libgsf"
brew "libsass"
brew "libsodium"
brew "vala"
brew "libsoup"
brew "libxml2"
brew "libyaml"
brew "little-cms2"
brew "lolcat"
brew "make"
brew "makedepend"
brew "mas"
brew "maven"
brew "md5sha1sum"
brew "netcat"
brew "nghttp2"
brew "nginx"
brew "nmap"
brew "optipng"
brew "orc"
brew "p7zip"
brew "packer"
brew "pidof"
brew "pngcrush"
brew "protobuf", args: ["HEAD"]
brew "pstree"
brew "py2cairo"
brew "pygobject3"
brew "qt"
brew "sbt"
brew "scala"
brew "scons"
brew "sift"
brew "sl"
brew "socat"
brew "spdylay"
brew "sphinx-doc"
brew "terminal-notifier"
brew "terraform"
brew "tmate"
brew "tree"
brew "ttfautohint"
brew "unar"
brew "vips"
brew "watch"
brew "wget"
brew "xctool"
brew "zsh-syntax-highlighting"
brew "go-delve/delve/delve"

cask "1password"
cask "appcleaner"
cask "atom"
cask "caffeine"
cask "caskroom/versions/atom-beta"
cask "caskroom/versions/firefoxdeveloperedition"
cask "caskroom/versions/iterm2-beta"
cask "cyberduck"
cask "disk-inventory-x"
cask "diskwave"
cask "dropbox"
cask "fing"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "hashcat"
cask "hex-fiend"
cask "hipchat"
cask "insomnia"
cask "istat-menus"
cask "java"
cask "jetbrains-toolbox"
cask "kap"
cask "karabiner-elements"
cask "kdiff3"
cask "keybase"
cask "keycastr"
cask "kindle"
cask "magicprefs"
cask "mplayerx"
cask "ngrok"
cask "qlstephen"
cask "raindropio"
cask "royal-tsx"
cask "slack"
cask "transmit"
cask "tunnelblick"
cask "vlc"
cask "wireshark"

mas "GarageBand", id: 682658836
mas "GIF Brewery 3", id: 1081413713
mas "Gifox", id: 1082624744
mas "Image2Icon", id: 992115977
mas "iMovie", id: 408981434
mas "iPhoto", id: 408981381
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "SonicWall Mobile Connect", id: 822514576
mas "StuffIt Expander", id: 405580712
mas "Twitter", id: 409789998
mas "Wake Up Time", id: 495945638
mas "Xcode", id: 497799835
