tap "aws/tap"
tap "d12frosted/emacs-plus"
tap "go-delve/delve"
tap "heroku/brew"
tap "hmarr/tap"
tap "homebrew/binary"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/fuse"
tap "homebrew/head-only"
tap "homebrew/science"
tap "warrensbox/tap"
brew "ack"
brew "ant"
brew "archey"
brew "readline"
brew "asciinema"
brew "aspell"
brew "gettext"
brew "libffi"
brew "pcre"
brew "glib"
brew "atk"
brew "autoconf"
brew "awscli", args: ["HEAD"]
brew "bash"
brew "bazel"
brew "bfg"
brew "bison"
brew "blueutil"
brew "boost"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "pixman"
brew "cairo"
brew "carthage"
brew "ccat"
brew "jansson"
brew "libtool"
brew "protobuf"
brew "clamav"
brew "clang-format"
brew "cloc"
brew "gmp@4"
brew "cloog", link: false
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "ctop"
brew "cunit"
brew "curl", link: true
brew "ddrescue"
brew "go"
brew "dep"
brew "dialog"
brew "diff-so-fancy"
brew "direnv"
brew "dive"
brew "libyaml"
brew "docker-cloud"
brew "enchant"
brew "etcd"
brew "ffmpeg"
brew "fftw"
brew "findutils"
brew "pkg-config"
brew "gobject-introspection"
brew "icu4c"
brew "harfbuzz"
brew "jpeg"
brew "libtiff"
brew "pango"
brew "fontforge"
brew "fortune"
brew "fpp"
brew "fswatch"
brew "fzf"
brew "gmp"
brew "mpfr"
brew "gawk"
brew "webp"
brew "gd"
brew "gdb"
brew "gdk-pixbuf"
brew "git"
brew "git-lfs"
brew "libtasn1"
brew "nettle"
brew "gnutls"
brew "gsettings-desktop-schemas"
brew "glib-networking"
brew "glide"
brew "glpk"
brew "gnu-sed"
brew "gnu-tar"
brew "lua"
brew "qt"
brew "gnuplot"
brew "graphviz"
brew "grc"
brew "hicolor-icon-theme"
brew "libepoxy"
brew "gtk+3"
brew "hey"
brew "htop"
brew "httpie"
brew "hub"
brew "hugo"
brew "little-cms2"
brew "imagemagick"
brew "imagemagick@6"
brew "intltool"
brew "isl@0.11"
brew "isl@0.14"
brew "jq"
brew "node"
brew "jupyterlab"
brew "kafka"
brew "kops"
brew "libcaca"
brew "libev"
brew "libcouchbase"
brew "libexif"
brew "libssh2"
brew "libgit2"
brew "libgsf"
brew "libmpc"
brew "libmpc@0.8"
brew "librdkafka"
brew "libsass"
brew "libsodium"
brew "vala"
brew "libsoup"
brew "libssh"
brew "libxml2"
brew "lolcat"
brew "make"
brew "makedepend"
brew "mas"
brew "maven"
brew "md5sha1sum"
brew "midnight-commander"
brew "miller"
brew "mtr"
brew "netcat"
brew "nghttp2"
brew "nginx"
brew "ngrep"
brew "nmap"
brew "nodenv"
brew "nvm"
brew "onefetch"
brew "openjdk"
brew "optipng"
brew "orc"
brew "osx-cpu-temp"
brew "p7zip"
brew "packer"
brew "pidof"
brew "pngcrush"
brew "prototool"
brew "pssh"
brew "pstree"
brew "pv"
brew "py2cairo"
brew "pygobject3"
brew "ranger"
brew "reattach-to-user-namespace"
brew "rust"
brew "sbt"
brew "scala"
brew "scons"
brew "shellcheck"
brew "sift"
brew "sl"
brew "socat"
brew "spdylay"
brew "sphinx-doc"
brew "swift-protobuf"
brew "teleport"
brew "telnet"
brew "terminal-notifier"
brew "terragrunt"
brew "the_silver_searcher"
brew "tmate"
brew "tmux"
brew "tree"
brew "ttfautohint"
brew "unar"
brew "vips"
brew "watch"
brew "wget"
brew "xctool"
brew "yarn"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "aws/tap/aws-sam-cli"
brew "d12frosted/emacs-plus/emacs-plus@27"
brew "heroku/brew/heroku"
brew "hmarr/tap/codeowners"
brew "warrensbox/tap/tfswitch"

cask "1password"
cask "1password-cli"
cask "amazon-drive"
cask "amazon-music"
cask "appcleaner"
# cask "atom"
# cask "atom-beta"
# cask "azure-data-studio"
cask "charles"
# cask "clickup"
# cask "couchbase-server-enterprise"
# cask "cyberduck"
cask "dash"
# cask "dbeaver-community"
# cask "discord"
cask "diskwave"
cask "docker"
# cask "dropbox"
# cask "electric-sheep"
# cask "fantastical"
cask "fing"
cask "firefox"
cask "firefoxdeveloperedition"
cask "fontforge"
# cask "fork"
cask "gimp"
cask "github"
cask "google-chrome"
cask "google-drive-file-stream"
cask "gpg-suite"
cask "hex-fiend"
cask "insomnia"
cask "istat-menus"
cask "iterm2-nightly"
cask "java"
cask "java8"
cask "jetbrains-toolbox"
cask "kap"
cask "kdiff3"
cask "keybase"
cask "keycastr"
cask "mollyguard"
cask "mplayerx"
cask "mutify"
# cask "muzzle"
cask "ngrok"
# cask "notion"
cask "pock"
cask "postgres"
cask "postman"
cask "powershell"
cask "qlstephen"
# cask "raindropio"
cask "raspberry-pi-imager"
cask "royal-tsx"
# cask "signal"
cask "slack"
# cask "sony-ps4-remote-play"
# cask "toggl"
cask "transmit"
cask "tunnelblick"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "vmware-fusion"
cask "wireshark"
cask "zoomus"

mas "Amphetamine", id: 937984704
mas "ColorSlurp", id: 1287239339
mas "GarageBand", id: 682658836
mas "GIF Brewery 3", id: 1081413713
mas "Gifox", id: 1082624744
mas "Image2icon", id: 992115977
mas "iMovie", id: 408981434
mas "iPhoto", id: 408981381
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Speedtest", id: 1153157709
mas "StuffIt Expander", id: 405580712
mas "Tailscale", id: 1475387142
mas "Todoist", id: 585829637
mas "Tot", id: 1491071483
mas "Touch Pong", id: 1185339859
mas "Twitter", id: 1482454543
mas "Wake Up Time", id: 495945638
mas "Xcode", id: 497799835




brew untap homebrew/homebrew-binary
brew untap homebrew/homebrew-dupes
brew untap homebrew/homebrew-science
brew untap homebrew/homebrew-head-only
brew untap homebrew/homebrew-fuse